I can't repro the issue when I specify the legacy `role` format as advised with Terraform version `v1.5.6`:
```
Terraform will perform the following actions:

  # google_bigquery_dataset.dataset will be created
  + resource "google_bigquery_dataset" "dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "issue_7755"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + max_time_travel_hours      = (known after apply)
      + project                    = "wjchen-osconfig-test"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access {
          + role          = "OWNER"
          + user_by_email = "<email>"
        }
      + access {
          + domain = "google.com"
          + role   = "READER"
        }
    }
```

If anyone else still sees the problem, could you share a sample config?